app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(student_params(:first_name, :last_name))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-09-01 06:23:41.513773"], ["updated_at", "2019-09-01 06:23:41.513773"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params(:first_name))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-09-01 06:34:55.836949"], ["id", 1]]